# Pandas library

In [1]:
import pandas
print(pandas.__version__)

1.2.2

### creating object

In [2]:
# empty object
df = pandas.DataFrame()
print(df)
print()

# from list
data = [1,2,3,4,5]
df = pandas.DataFrame(data)
print(df)
print()

# multdimensional
data = [['rahul', 35], ['shailendra',25] ]
df = pandas.DataFrame(data,columns = ['Name','Age'])
print(df)
print()

df = pandas.DataFrame(data,columns = ['Name','Age'],dtype =float)
print(df)

Empty DataFrame
Columns: []
Index: []

   0
0  1
1  2
2  3
3  4
4  5

         Name  Age
0       rahul   35
1  shailendra   25

         Name   Age
0       rahul  35.0
1  shailendra  25.0

#### Create dataframe from dictionary

In [3]:
data = {'Name':['Avinash','vinay', 'kritpal'],
        'Age': [35,4,393]}
df = pandas.DataFrame(data,index = ['r1','r2','r3'])
print(df)
print()

# if dict doesn't provide a key value, it is taken as NaN
data = [{'a':1,'b':2},
        {'a':5,'b':4,'c':9}]
df = pandas.DataFrame(data)
print(df)

       Name  Age
r1  Avinash   35
r2    vinay    4
r3  kritpal  393

   a  b    c
0  1  2  NaN
1  5  4  9.0

### Dataset

In [4]:
df = pandas.read_json('files\\data.json')
print(df.head(5)) #view first 5 rows
print(df.tail(5)) # view last 5 rows
print()
# pandas indexing works like dict indexing.

print(df.columns) #prints all columns
print()
print(df.info()) # print information of all columns
print()


# accessing values of a column
print(df['Pulse'])
print()
# get max value
print(df['Pulse'].max())

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0
     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 6.6 KB
None

0      110
1      117
2      103
3      109
4      117
      ...
164    105
165    110
166    115
167    120
168    125
Name: Pulse, Length: 169, dtype: int64

159

In [5]:
df = pandas.read_csv('files\\nyc_weather.csv')
print(type(df['Temperature'])) # series
print(type(df[['Temperature','EST']])) # dataframe
print()

# find temperature and date on which rain happens
print(df[['Temperature','EST']][(df['Events']=='Rain') & (df['Temperature'] == df['Temperature'].max())])
print(df.shape)
rows, columns = df.shape
print(df[2:16])

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

   Temperature        EST
9           50  1/10/2016
(31, 11)
          EST  Temperature  DewPoint  Humidity  Sea Level PressureIn  \
2    1/3/2016           40        21        47                 29.86
3    1/4/2016           25         9        44                 30.05
4    1/5/2016           20        -3        41                 30.57
5    1/6/2016           33         4        35                 30.50
6    1/7/2016           39        11        33                 30.28
7    1/8/2016           39        29        64                 30.20
8    1/9/2016           44        38        77                 30.16
9   1/10/2016           50        46        71                 29.59
10  1/11/2016           33         8        37                 29.92
11  1/12/2016           35        15        53                 29.85
12  1/13/2016           26         4        42                 29.94
13  1/14/2016           30        12        47                 29.95
14  1/15/2016           43        31        62                 29.82
15  1/16/2016           47        37        70                 29.52

    VisibilityMiles  WindSpeedMPH PrecipitationIn  CloudCover Events  \
2                10           8.0               0           1    NaN
3                10           9.0               0           3    NaN
4                10           5.0               0           0    NaN
5                10           4.0               0           0    NaN
6                10           2.0               0           3    NaN
7                10           4.0               0           8    NaN
8                 9           8.0               T           8   Rain
9                 4           NaN             1.8           7   Rain
10               10           NaN               0           1    NaN
11               10           6.0               T           4    NaN
12               10          10.0               0           0    NaN
13               10           5.0               T           7    NaN
14                9           5.0               T           2    NaN
15                8           7.0            0.24           7   Rain

    WindDirDegrees
2              277
3              345
4              333
5              259
6              293
7               79
8               76
9              109
10             289
11             235
12             284
13             266
14             101
15             340

### Getting data statistics

In [6]:
df.describe()

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

**Assignment :** take a dataframe in form of multidimension list.
you have to design another dataframe which you will be taking from dict. task is to add column of dict dataframe in to the first dataframe.

In [7]:
data_list = [['ajay',2,234],['vinay', 4,9399],['suraj',6,3939]]
data_dict = {'mob':[4993,9933,59932],'dob':[22353,4434,6643]}

df_list = pandas.DataFrame(data_list)
print(df_list)
print()

df_list[3] = df_list[1]+df_list[2]
print(df_list)


df_dict = pandas.DataFrame(data_dict)
print(df_dict)

new_df = df_list.copy()
new_df[[4,5]] = df_dict[:]
print(new_df)

       0  1     2
0   ajay  2   234
1  vinay  4  9399
2  suraj  6  3939

       0  1     2     3
0   ajay  2   234   236
1  vinay  4  9399  9403
2  suraj  6  3939  3945
     mob    dob
0   4993  22353
1   9933   4434
2  59932   6643
       0  1     2     3      4      5
0   ajay  2   234   236   4993  22353
1  vinay  4  9399  9403   9933   4434
2  suraj  6  3939  3945  59932   6643

# Reading and storing file

In [8]:
df = pandas.read_excel('files\\weather_data.xlsx')
print(df)

# storing this file
df.to_csv('files\\rahul.csv',index=False)
# similarly you can write this file as xls
df.to_excel('files\\rahul.xls',sheet_name='weather',index=False)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

### Group By

In [9]:
df = pandas.read_csv('files\\weather_data_cities.csv')
group_df = df.groupby('city')
print(group_df) # dataframe groupby object.

df_g = pandas.DataFrame(group_df) #convert it again to dataframe

for city, city_dataframe in group_df:
    print('Dataframe of :',city,':')
    print(city_dataframe)

# another way
print(group_df.get_group('new york'))
print()
print()
print(group_df['day'].max()) 
print(group_df.max()) # return max of all elements in a group
group_df.describe() # statistic operation work on numerical columns only

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001A52C53F0D0>
Dataframe of : mumbai :
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
Dataframe of : new york :
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
Dataframe of : paris :
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny


city
mumbai      1/4/2017
new york    1/4/2017
paris       1/4/2017
Name: day, dtype: object
               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

### concatenate data frames

In [10]:
india_weather = pandas.DataFrame({'city':['hyderabad','bangalore','pune'],'temperature': [33,26,39],'humidity':[80,60,84]})
us_weather = pandas.DataFrame({'city':['hyderabad','bangalore','pune'],'temperature': [33,26,39],'humidity':[80,60,84]})
df = pandas.concat([india_weather,us_weather],ignore_index=True)
print(df)
df = pandas.concat([india_weather,us_weather],axis = 1,ignore_index=True)
print(df)

print(india_weather.merge(us_weather,left_on='city',right_on='city',how='left'))
print(india_weather.merge(us_weather,on='city'))

        city  temperature  humidity
0  hyderabad           33        80
1  bangalore           26        60
2       pune           39        84
3  hyderabad           33        80
4  bangalore           26        60
5       pune           39        84
           0   1   2          3   4   5
0  hyderabad  33  80  hyderabad  33  80
1  bangalore  26  60  bangalore  26  60
2       pune  39  84       pune  39  84
        city  temperature_x  humidity_x  temperature_y  humidity_y
0  hyderabad             33          80             33          80
1  bangalore             26          60             26          60
2       pune             39          84             39          84
        city  temperature_x  humidity_x  temperature_y  humidity_y
0  hyderabad             33          80             33          80
1  bangalore             26          60             26          60
2       pune             39          84             39          84

### loc[] and iloc[]

In [11]:
print(df.iloc[0])# index vise locate
df.loc[2] # index name vise locate

# iloc 0 based indexing
# loc indexing given by us or default 0 based indexing

0    hyderabad
1           33
2           80
3    hyderabad
4           33
5           80
Name: 0, dtype: object

0    pune
1      39
2      84
3    pune
4      39
5      84
Name: 2, dtype: object

## Data Preprocessing
### Handling missing values

if Nan values are in numerical data, we can remove them by finding mean/median.

if it is a categorical data, answer is maximum value count (mode)

In [12]:
cars_data = pandas.read_csv('files\\Toyota.csv',index_col=0,na_values=['??','????'])
# if ?? or ???? found, consider it as Nan
cars_data

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86.0,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86.0,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86.0,1.0,0,1300,3,1015
1435,6950,76.0,1.0,Petrol,110.0,0.0,0,1600,5,1114

In [13]:
cars_data2 = cars_data.copy()
cars_data2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [14]:
#isna or isnull works same
cars_data2.isna().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [15]:
missing = cars_data2[cars_data2.isnull().any(axis = 1)]
missing # finds all rows which have Nan in atleast one column

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
6,16900,27.0,NaN,Diesel,NaN,NaN,0,2000,3,1245
7,18600,30.0,75889.0,NaN,90.0,1.0,0,2000,3,1245
9,12950,23.0,71138.0,Diesel,NaN,NaN,0,1900,3,1105
15,22000,28.0,18739.0,Petrol,NaN,0.0,0,1800,3,1185
...,...,...,...,...,...,...,...,...,...,...
1428,8450,72.0,NaN,Petrol,86.0,NaN,0,1300,3,1015
1431,7500,NaN,20544.0,Petrol,86.0,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86.0,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86.0,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86.0,1.0,0,1300,3,1015

In [16]:
cars_data2.describe()

,Price,Age,KM,HP,MetColor,Automatic,CC,Weight
count,1436.000000,1336.000000,1421.000000,1430.000000,1286.000000,1436.000000,1436.000000,1436.00000
mean,10730.824513,55.672156,68647.239972,101.478322,0.674961,0.055710,1566.827994,1072.45961
std,3626.964585,18.589804,37333.023589,14.768255,0.468572,0.229441,187.182436,52.64112
min,4350.000000,1.000000,1.000000,69.000000,0.000000,0.000000,1300.000000,1000.00000
25%,8450.000000,43.000000,43210.000000,90.000000,0.000000,0.000000,1400.000000,1040.00000
50%,9900.000000,60.000000,63634.000000,110.000000,1.000000,0.000000,1600.000000,1070.00000
75%,11950.000000,70.000000,87000.000000,110.000000,1.000000,0.000000,1600.000000,1085.00000
max,32500.000000,80.000000,243000.000000,192.000000,1.000000,1.000000,2000.000000,1615.00000

In [17]:
print(cars_data2['Age'].mean())

# to deal with NaN value, replace all NaN with mean
cars_data2['Age'].fillna(cars_data2['Age'].mean(),inplace = True)
cars_data2['HP'].fillna(cars_data2['HP'].mean(),inplace = True)
cars_data2['KM'].fillna(cars_data2['KM'].mean(),inplace = True)
print(cars_data2.isna().sum())

55.67215568862275
Price          0
Age            0
KM             0
FuelType     100
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

### Imputation of categorical data
#### For FuelType

In [18]:
print(cars_data2['FuelType'].value_counts())
# value counts always returns values in descending order

Petrol    1177
Diesel     144
CNG         15
Name: FuelType, dtype: int64

In [22]:
# print(cars_data2['FuelType'].value_counts()[0])
print(cars_data2['FuelType'].value_counts().index[0])

cars_data2['FuelType'].fillna(cars_data2['FuelType'].value_counts().index[0],inplace = True)
print(cars_data2['FuelType'].value_counts())

Petrol
Petrol    1277
Diesel     144
CNG         15
Name: FuelType, dtype: int64

#### For MetColor

In [27]:
print(cars_data2['MetColor'].value_counts())
print()
print(cars_data2['MetColor'].value_counts().index[0])
print()
print(cars_data2['MetColor'].mode())
print()
print(cars_data2['MetColor'].mode()[0])
print()

cars_data2['MetColor'].fillna(cars_data2['MetColor'].value_counts().index[0], inplace = True)

1.0    868
0.0    418
Name: MetColor, dtype: int64

1.0

0    1.0
dtype: float64

1.0

In [29]:
cars_data2.isna().sum()
cars_data2.to_csv('files\\Toyota_null_clean.csv')

## Using Lambda functions in dataframe

In [65]:
cars_data3 = pandas.read_csv('files\\Toyota.csv', na_values=['??','????'], index_col = 0)

In [67]:
my_lambda = lambda x : x.fillna(x.mean) if x.dtype == float else x.fillna(x.value_counts().index[0])

cars_data3 = cars_data3.apply(my_lambda)
# this will apply the lambda function to all columns of the dataframe. here column is passed as x

# apply function is not inplace so, we have to override dataframe value.

# cars_data3.info()
# cars_data3.describe()
cars_data3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1436 non-null   object
 2   KM         1436 non-null   object
 3   FuelType   1436 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1436 non-null   object
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: int64(4), object(6)
memory usage: 123.4+ KB

__Task 2__ : Write a function to impute the missing numerical and categorical values in toyota dataset. also store the refined dataset, for which model can be generated.

In [85]:
def impute_null(df):
    for col in df.columns:
        if df[col].isna().sum() > 0:
            if(df[col].dtype in [int,float]):
                df[col].fillna(df[col].mean(),inplace = True)
            else:
                df[col].fillna(df[col].value_counts().index[0],inplace = True)

cars_data4 = pandas.read_csv('files\\Toyota.csv', na_values=['??','????'], index_col = 0)

impute_null(cars_data4)
cars_data4.info()
cars_data4.to_csv('files\\Toyota_impute_null.csv')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1436 non-null   float64
 2   KM         1436 non-null   float64
 3   FuelType   1436 non-null   object
 4   HP         1436 non-null   float64
 5   MetColor   1436 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [87]:
# using apply

def impute_null2(col):
    if col.isna().sum() > 0:
        if(col.dtype in [int,float]):
            col = col.fillna(col.mean())
        else:
            col = col.fillna(col.value_counts().index[0])
    return col

cars_data5 = pandas.read_csv('files\\Toyota.csv', na_values=['??','????'], index_col = 0)

cars_data6 = cars_data5.apply(impute_null2)
cars_data6.info()
cars_data6.to_csv('files\\Toyota_impute_null.csv')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1436 non-null   float64
 2   KM         1436 non-null   float64
 3   FuelType   1436 non-null   object
 4   HP         1436 non-null   float64
 5   MetColor   1436 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

__Task 3__ : write a function, to identify the unique values in dataset so we can preprocess the data by changing the actual datatype and removing noise values.

In [108]:
def find_unique(df):
    l = []
    for col in df.columns:
        l.append(df[col].unique())
    for item in l:
        print(item)
        print()
    return l

cars_data = pandas.read_csv('files\\Toyota.csv', na_values=['??','????'], index_col = 0)

find_unique(cars_data)

[13500 13750 13950 14950 12950 16900 18600 21500 20950 19950 19600 22500
 22000 22750 17950 16750 16950 15950 16250 17495 15750 15500 14750 19000
 15800 21950 20500 13250 15250 18950 15999 16500 18750 22250 12995 18450
 16895 14900 17250 15450 16650 17450 16450 18900 18990 18500 19450 18800
 32500 31000 31275 24950 22950 24990 17900 19250 16350 21750 15850 23000
 19900 23950 24500 17200 19500 16868 19750 20750 17650 17795 18245 23750
 18700 21125  6950  9500 11950  7750  4350  4750 11750 11900  9950 11495
 11250 10500 10450 11500 12500 10950 11450 11790 12450 11690 12750 11925
 12900 11650 10850  9940 13450 12495 12000 11480 14990 12850 11700 11895
 13875 12295 13995  9900 11990 10750 11695 11000 12400 12200 12695 14350
 10250  6500  6400  7000  8900  8500  8950  9250  9450  8250  4450  9000
  5150  7900 10900  9750 11290 10895 10995  9850  8695 10990  8750  9930
  9799  9700  9990  9475 10000 10495  9400  9650  9550 13000 11710  9980
 12250 11930 10800 10600  7500  5950  6900  5751  7950  6250  8450  7350
  9800  7995  8600  7250  8000  8495  9895  7999  8490  8150  7450  9130
  8990  8995  9995 10400  8800  7800  8100  8200 10295  9795 10350  8400
  8895  9390  8745  8850  9695  9245  5900  6000  5250  4400  6750  6150
  5750  5800  5740  6550  6450  5600  6650  7600  7460  6800  8700  6640
  8050  7795  6490  6425  6495  6990  7200  7300  9200  7850  7495  7990
  7490  7145  7400  6999  7499  7150  5845 10845]

[23. 24. 26. 30. 32. 27. 25. 22. 31. 28. 29. nan 20. 19. 17. 11. 18. 13.
 14.  4.  8.  7. 16. 15. 10. 12.  9.  6.  2.  1. 43. 38. 40. 44. 41. 37.
 39. 42. 35. 34. 33. 36. 53. 51. 54. 45. 55. 48. 52. 49. 56. 50. 47. 46.
 58. 68. 59. 62. 65. 67. 64. 60. 61. 66. 57. 63. 73. 79. 78. 74. 77. 69.
 80. 76. 70. 71. 75. 72.]

[46986. 72937. 41711. ... 30964. 20544. 17016.]

['Diesel' nan 'Petrol' 'CNG']

[ 90.  nan 192. 110.  97.  71. 116.  98.  69.  86.  72. 107.  73.]

[ 1. nan  0.]

[0 1]

[2000 1800 1900 1600 1400 1598 1995 1398 1300 1587 1975 1332]

['three' '3' '5' '4' 'four' 'five' '2']

[1165 1170 1245 1185 1105 1065 1120 1100 1255 1270 1110 1195 1180 1075
 1130 1275 1060 1115 1265 1260 1125 1155 1045 1480 1320 1280 1135 1090
 1150 1085 1160 1205 1084 1140 1095 1025 1119 1080 1121 1615 1067 1040
 1030 1055 1050 1103 1070 1035 1015 1000 1078 1079 1109 1020 1010 1114
 1172 1094 1083]